[{"key":"Mirashe2010","type":"article","abstract":"{Computing as you know it is about to change, your applications and documents are going to move from the desktop into the cloud. I'm talking about cloud computing, where applications and files are hosted on a \"cloud\" consisting of thousands of computers and servers, all linked together and accessible via the Internet. With cloud computing, everything you do is now web based instead of being desktop based. You can access all your programs and documents from any computer that's connected to the Internet. How will cloud computing change the way you work? For one thing, you're no longer tied to a single computer. You can take your work anywhere because it's always accessible via the web. In addition, cloud computing facilitates group collaboration, as all group members can access the same programs and documents from wherever they happen to be located. Cloud computing might sound far-fetched, but chances are you're already using some cloud applications. If you're using a web-based email program, such as Gmail or Hotmail, you're computing in the cloud. If you're using a web-based application such as Google Calendar or Apple Mobile Me, you're computing in the cloud. If you're using a file- or photo-sharing site, such as Flickr or Picasa Web Albums, you're computing in the cloud. It's the technology of the future, available to use today.}","archiveprefix":"{arXiv}","arxivid":"{1003.4074}","author":"{Mirashe, Shivaji P and Kalyankar, N V}","doi":"{10.1145/358438.349303}","eprint":"{1003.4074}","isbn":"{1-58113-199-2}","issn":"{03621340}","journal":"{Communications of the ACM}","keywords":"{4/A/iii-Service Architecture and Designs,Cloud,Cloud Computing,Cloud computing,Computing,Display,Introdu\\c{c}\\~{a}o,Mobile Cloud,Suggested Topics,Tech,The Cloud,Tizen,acm,cc,cloud,cloud computing,cloud-computing,lista\\_filtrada,not,notes,print,science,software,spi u2epc3,thin-client}","mendeley-tags":"{4/A/iii-Service Architecture and Designs,Cloud,Cloud Computing,Cloud computing,Computing,Display,Introdu\\c{c}\\~{a}o,Mobile Cloud,Suggested Topics,Tech,The Cloud,Tizen,acm,cc,cloud,cloud computing,cloud-computing,lista\\_filtrada,not,notes,print,science,software,spi u2epc3,thin-client}","pages":"{9}","pmid":"{22988693}","title":"{{Cloud Computing}}","url":"{http://arxiv.org/abs/1003.4074}","volume":"{51}","year":"{2010}"},{"key":"Unhelkar2010","type":"article","abstract":"{Enterprises face several challenges in deploying mobile applications, emanating from features such as location independence, contextualization, and personalization. The six-layer enterprise mobile applications development framework offers a systematic and comprehensive solution to mobile application development and maintenance. The taxonomy of enterprise mobile application are mobile broadcast, mobile information, mobile transaction, mobile operation, mobile collaboration.}","author":"{Unhelkar, B. and Murugesan, S.}","doi":"{10.1109/MITP.2010.45}","isbn":"{1520-9202 VO - 12}","issn":"{1520-9202}","journal":"{IT Professional}","keywords":"{Enterprise mobile applications,information technology,mobile application challenges,mobile application development framework,mobile/wireless}","title":"{{The Enterprise Mobile Applications Development Framework}}","volume":"{12}","year":"{2010}"},{"key":"Huiying2010","type":"article","abstract":"{This paper discusses the change of mobile government after combining with mobile computing technology. With the new pattern of mobile city, it solves problems such as terminal and network bandwidth in the areas of mobile government, mobile commerce and mobile life. At the same time, it will greatly improve the carrying capacity, processing power and application processes of mobile city service applications. Though it is just a blue picture we draw, mobile computing will be extremely applied in mobile city.}","author":"{Huiying, Du Huiying Du and Tingjie, Lu Tingjie Lu and Jiale, Liu Jiale Liu and Miao, Wu Miao Wu}","doi":"{10.1109/ICNDS.2010.5479621}","isbn":"{978-1-4244-5162-3}","journal":"{Networking and Digital Society (ICNDS), 2010 2nd International Conference on}","keywords":"{Mobile Government,e-government,m-government platform,mobile city,mobile commerce,mobile computing}","mendeley-tags":"{Mobile Government}","title":"{{The consider on the construction of mobile city combined with mobile computing technology: a case of mobile government}}","volume":"{1}","year":"{2010}"},{"key":"K.N.2010","type":"article","abstract":"{One or more mobile nodes with mobile router(s) form a mobile network. Mobile router acts as the single point of attachment to the internet. As the configuration of mobile network changes, mobile router keeps track of its registered mobile nodes. Presently, a scheme has been designed for group registration of mobile nodes under a single home agent. In this paper, a communication scheme is proposed to send common messages to a group of registered mobile nodes in the mobile network simultaneously through the mobile router. Results show that this scheme not only improves utilization of bandwidth but also reduces end to end delay.}","author":"{K.N., Rama Mohan Babu and J., Prathima Mabel and Murthy, K.N. Balasubramanya and Mamatha}","doi":"{10.1109/ICETET.2010.67}","isbn":"{978-0-7695-4246-1}","issn":"{2157-0477}","journal":"{2010 3rd International Conference on Emerging Trends in Engineering and Technology}","keywords":"{Group Binding Update,Group Communication,Group Registration Request,Mobile Network,Mobile Router}","pages":"{304--307}","title":"{{Group Communication Scheme for Mobile Networks with Mobile Router}}","year":"{2010}"},{"key":"Babu2010","type":"article","abstract":"{One or more mobile nodes with mobile router(s) form a mobile network. Mobile router acts as the single point of attachment to the internet. As the configuration of mobile network changes, mobile router keeps track of its registered mobile nodes. Presently, a scheme has been designed for group registration of mobile nodes under a single home agent. In this paper, a communication scheme is proposed to send common messages to a group of registered mobile nodes in the mobile network simultaneously through the mobile router. Results show that this scheme not only improves utilization of bandwidth but also reduces end to end delay.}","author":"{Babu, K.N. Rama Mohan and Prathima, M.J. and Murthy, K.N.B. and Mamatha, Mamatha}","doi":"{10.1109/ICETET.2010.67}","isbn":"{978-1-4244-8481-2}","issn":"{2157-0477}","journal":"{Emerging Trends in Engineering and Technology (ICETET), 2010 3rd International Conference on}","keywords":"{Group Binding Update,Group Communication,Group Registration Request,Mobile Network,Mobile Router}","title":"{{Group Communication Scheme for Mobile Networks with Mobile Router}}","year":"{2010}"},{"key":"Khan2011","type":"article","abstract":"{ABSTRACT In the past decade, due to technological advancement in wireless communications, mobile computing, and multimedia streaming mobile multimedia has experienced an explosive development. This paper shows the key issues of Mobile Multimedia Database Systems and the issues that need to take into consideration in the future. Keywords: Mobile Multimedia databases, Mobile cloud computing.}","author":"{Khan, Amreen and Ahirwar, Kamalkant}","journal":"{Database}","keywords":"{4/A/ii-Data and Storage Architecture,Mobile Cloud Computing,mobile,mobile cloud computing,mobile multimedia databases}","mendeley-tags":"{4/A/ii-Data and Storage Architecture,Mobile Cloud Computing,mobile}","pages":"{219--221}","title":"{{Mobile cloud computing as a future of mobile multimedia database}}","volume":"{2}","year":"{2011}"},{"key":"Yuan2006","type":"article","abstract":"{In this paper we propose a theoretical model to assess the effectiveness of mobile work support by investigating the fit between mobile task and mobile work support. The mobile task has been investigated along five dimensions: task difficulty, task inter dependency, time-criticality, mobility, and location dependency. The functionality of mobile support technology is categorized along five dimensions: portable processing power, mobile communication, mobile online information access, mobile job dispatch, and location-aware services. Propositions are proposed for testing the impact of the fit between mobile task and mobile support on the performance of mobile worker.}","author":"{Yuan, Yufei Yuan Yufei and Zheng, Wuping Zheng Wuping}","doi":"{10.1109/ICMB.2006.44}","isbn":"{978-0-7695-2595-2}","journal":"{2006 International Conference on Mobile Business}","title":"{{The Fit between Mobile Task and Mobile Work Support: A Theoretical Framework}}","year":"{2006}"},{"key":"Su2005","type":"article","abstract":"{The declining screen size of the mobile phone makes mobile news difficult to be presented efficiently. Although much effort has been contributed to improve the navigation and usability on the mobile news, it gains less popularity among the mobile users. It gives a poor user experience while navigating the mobile news. This paper considers the usability issues when navigating the mobile news. The aims of this paper are examining and proposing the suitable Web navigation structure to be designed for the mobile news. The research outcomes established that the cross-linked navigation structure significantly promotes the navigation on the mobile news}","author":"{Su, K.S. and Chan, D. and Chan, F.C.}","doi":"{10.1109/MTAS.2005.207196}","isbn":"{981-05-4573-8}","journal":"{2005 2nd Asia Pacific Conference on Mobile Technology, Applications and Systems}","keywords":"{Internet,Mobile computing,Mobile phone,Navigation,Web navigation,cross-linked navigation structure,mobile handsets,mobile news}","mendeley-tags":"{Internet,Mobile computing,Mobile phone,Navigation,Web navigation,cross-linked navigation structure,mobile handsets,mobile news}","title":"{{Navigation on mobile news}}","year":"{2005}"},{"key":"Kahar2011","type":"article","abstract":"{Mobile communication technology is one of the most popular and important communications at this moment. The field of robotics includes various sectors such as factory sector, manufacturing and security. This paper presents the utilization of different mobile technology for mobile robot controller such as Bluetooth, Wi-Fi or Wireless LAN and 3G. Comparison of the frequency, data rate and range for each mobile technology used in this application are discussed. For future work, we propose the development of mobile robot controller via mobile technology, which is 3G technology. The results of this research are expected to provide benefits to consumers and mobile device manufacturers to optimize the usability of mobile devices.}","author":"{Kahar, Saliyah and Sulaiman, Riza and Amran, Mohd Fahmi Mohamad and Marjudi, Suziyanti and Prabuwono, Anton Satria}","doi":"{10.1109/ICOS.2011.6079301}","isbn":"{978-1-61284-930-0}","journal":"{2011 IEEE Conference on Open Systems}","keywords":"{Mobile Communication,Mobile Robot,Mobile Robot Controller,Mobile Technology}","pages":"{166--170}","title":"{{Utilization of mobile technology for mobile robot controller}}","year":"{2011}"},{"key":"Le2005","type":"article","abstract":"{ This paper presents a mobile affiliation model that supports sharing information among mobile transactions. The model allows mobile hosts to form a dynamic workgroup, called mobile affiliation, by taking advantages of wireless communication technologies. In the MOWAHS transaction system, mobile transactions can exchange data in a mobile sharing space, called export-import repository, in both synchronous and asynchronous manner. The database consistency in the mobile affiliation is ensured by export and import transactions. We show that our mobile affiliation model has superior power for supporting mobile transactions by taking into account the disconnection of wireless networks, the limitation of computing power of mobile devices, and the mobility of computing hosts.}","author":"{Le, H.N. and Nygaard, M.}","doi":"{10.1109/DEXA.2005.136}","isbn":"{0-7695-2424-9}","issn":"{1529-4188}","journal":"{16th International Workshop on Database and Expert Systems Applications (DEXA'05)}","keywords":"{Mobile transaction,mobile database,mobility}","title":"{{Mobile transaction system for supporting mobile work}}","year":"{2005}"},{"key":"Saddik2008","type":"article","abstract":"{Mobile peer-to-peer (P2P) can be understood in two different ways: as a P2P system where the participating peers are mobile or as mobile peers using the P2P paradigm to implement an application.}","author":"{Saddik, Abdulmotaleb El and Roczniak, Andrew}","isbn":"{978-1-4200-4326-6}","journal":"{Encyclopedia of Wireless and Mobile Communications}","pages":"{759}","title":"{{Mobile P2P: Data Retrieval and Caching}}","url":"{http://www.informaworld.com/10.1081/E-EWMC-120043570}","year":"{2008}"},{"key":"Savitz2012","type":"article","abstract":"{The article tackles the issue of mobile security. It explores mobile phones and mobile applications' vulnerability to cyber-criminal activity, the profitability of mobile malware and the business...}","author":"{Savitz, Eric and Johnson, Kevin}","journal":"{Forbes}","pages":"{3}","title":"{{CIOs Must Address The Growing Mobile Device Security Threat.}}","url":"{http://search.ebscohost.com/login.aspx?direct=true\\&db=bth\\&AN=79456011}","year":"{2012}"},{"key":"Borgermann2009","type":"article","abstract":"{The mobile market is characterized by a large number of mobile phone providers. Therefore the market entrance is very difficult for newcomer. This article presents an algorithm for simulating the behavior of changing the mobile phone provider regarding to several given competing mobile tariffs and ones own.}","author":"{Borgermann, C. and Lackes, R.}","doi":"{10.1109/ICIFE.2009.15}","isbn":"{978-0-7695-3606-4}","journal":"{2009 International Conference on Information and Financial Engineering}","keywords":"{Germany,PRICING,algorithm,marketing data processing,mobile handsets,mobile phone market,mobile tariffs,pricing strategies,simulation,strategic planning,tariffs}","mendeley-tags":"{PRICING,marketing data processing,mobile handsets,mobile phone market,mobile tariffs,pricing strategies,strategic planning,tariffs}","title":"{{Pricing Strategies in the Mobile Phone Market - An Algorithm for Simulating the Success of Mobile Tariff}}","year":"{2009}"},{"key":"Yuan2009","type":"article","abstract":"{The rapid growth of wireless communication and portable devices in recent years has created a great potential of providing mobile work support for mobile workers. However not all mobile tasks require or can benefit from the use of mobile work support. In order to identify appropriate mobile technologies for various kinds of mobile work supports, we need to fully understand the nature of mobile work and the needs for mobile work support. In this paper we develop a theoretical framework and conduct an empirical study to compare the two types of mobile workers: mobile knowledge workers and field workers. This study will help us to assess the needs of mobile work support for different types of mobile workers.}","author":"{Yuan, Yufei Yuan Yufei and Zheng, Wuping Zheng Wuping}","doi":"{10.1109/ICMB.2009.9}","isbn":"{978-0-7695-3691-0}","journal":"{2009 Eighth International Conference on Mobile Business}","keywords":"{Field Worker,Mobile Worker,Road workers,mobile work support system,mobile worker}","mendeley-tags":"{Field Worker,Mobile Worker,Road workers}","title":"{{Mobile Task Characteristics and the Needs for Mobile Work Support: A Comparison between Mobile Knowledge Workers and Field Workers}}","year":"{2009}"},{"key":"Sharples2005","type":"article","abstract":"{There is a need to re-conceptualise learning for the mobile age, to recognise the essential role of mobility and communication in the process of learning, and also to indicate the importance of context in establishing meaning, and the transformative effect of digital networks in supporting virtual communities that transcend barriers of age and culture. In this paper we offer a framework for theorising about mobile learning, to complement theories of infant, classroom, workplace and informal learning. A related aim is to inform the design of new environments and technologies to support mobile learning, since the work described here has been developed through a series of projects to design mobile learning technology. In the tradition of Activity Theory we analyse learning as a cultural-historical activity system, mediated by tools that both constrain and support the learners in their goals of transforming their knowledge and skills. We separate two perspectives, or layers, of tool-mediated activity. The semiotic layer describes learning as a semiotic system in which the learners object- oriented actions are mediated by cultural tools and signs. The technological layer represents learning as an engagement with technology, in which tools such as computers and mobile phones function as interactive agents in the process of coming to know. These layers can be prised apart, to provide either a semiotic framework to promote discussion with educational theorists to analyse learning in the mobile age, or a technological framework for software developers and engineers to propose requirements for the design and evaluation of new mobile learning systems. Or the layers can be superimposed to examine the dynamics and co-evolution of learning and technology.}","author":"{Sharples, Mike and Taylor, Josie and Vavoula, Giasemi}","doi":"{citeulike-article-id:6652555}","issn":"{0013936X}","journal":"{Proceedings of mLearn 2005}","keywords":"{Activity Theory,Aprendizagem M\\'{o}vel,Cap1,Dissertation,Education,Folder - モバイル,General,Google Scholar,Mobile,Mobile learning,Stacy Anderson,Teoria da Atividade,Theortical Framework,activity theory,design mobile learning,design of mobile learning systems,google,m-learning,mobile,mobile learning,mobile- m-learning- activity theory,mobile-learning,p01348,p03006,systems,theory,theory mobile learning,theory of mobile learning,towards a theory,unread}","mendeley-tags":"{Activity Theory,Aprendizagem M\\'{o}vel,Cap1,Dissertation,Education,Folder - モバイル,General,Google Scholar,Mobile,Mobile learning,Stacy Anderson,Teoria da Atividade,Theortical Framework,activity theory,design of mobile learning systems,google,m-learning,mobile,mobile learning,mobile- m-learning- activity theory,mobile-learning,p01348,p03006,theory,theory of mobile learning,unread}","pages":"{1--9}","pmid":"{18409625}","title":"{{Towards a Theory of Mobile Learning}}","volume":"{1}","year":"{2005}"},{"key":"Yang2007","type":"article","abstract":"{On the basis of analyzing the limitations of mobile IP protocol in pervasive computing environment and in combination with the technological advantages of mobile agent, this paper introduces a mobile-agent-based application model of pervasive mobile devices. With the introduction of mobile agent into the pervasive mobile devices, the application model enables all corresponding IP messages to go through the mobile agent, which can directly detect the status information of the IP messages, thus making it possible to switch the mobile devices smoothly. Through handoff delay analysis and simulation experiments, the paper also analyses and contrasts the performance of the pervasive mobile devices before and after the mobile agent is introduced. The results show that with the introduction of mobile agent, the pervasive mobile devices can switch smoothly and swiftly, decrease handoff delay and the status information in the process of the transmission and reduce the loss ratio of handoff of the mobile devices, thus effectively improving the performance of the mobile networks in the pervasive computing environment.}","author":"{Yang, Xiang Yang Xiang and Zhang, Yuanyi Zhang Yuanyi and Niu, Qinzhou Niu Qinzhou and Tao, Xiaomei Tao Xiaomei and Wu, Luo Wu Luo}","doi":"{10.1109/ICPCA.2007.4365402}","isbn":"{978-1-4244-0971-6}","journal":"{2007 2nd International Conference on Pervasive Computing and Applications}","keywords":"{mobile IP protocol,mobile agent,pervasive computing,pervasive mobile devices}","title":"{{A Mobile-Agent-Based Application Model Design of Pervasive Mobile Devices}}","year":"{2007}"},{"key":"Punithavathi2008","type":"article","abstract":"{Mobile computing environment has a wireless network, which can cause signal disturbance, spurious disconnection by handoff, voluntary disconnection to use power efficiently and unpredictable transmission error. In this paper, how a mobile agent system is used to provide optimized solution for mobile computing environment in spite of having more problems. In this project, a mobile agent is created for every request made by the user. The mobile agent departs from the mobile host and then searches for the information appropriate to the user's requirements. After the job is completed, they bring the results to the mobile host. Since the mobile agents do not need continuous communication with the mobile host, they are not affected by the sudden disconnection of wireless network and the situation of turning mobile host off for power saving. A critical problem can arise if the mobile host is disconnected while the mobile agent wants to return the result from the user's request to mobile host. This paper deals with the problems in mobile computing environment and the solution.}","author":"{Punithavathi, R. and Duraiswamy, K.}","doi":"{10.1109/ICCCNET.2008.4787669}","isbn":"{978-1-4244-3594-4}","journal":"{2008 International Conference on Computing, Communication and Networking}","keywords":"{Foreign Agent,Home Agent,Mobile Computing Environment,Mobile Host,Mobile Support Station,Mobile agent Server,Proxy Agent,Run-Time Environment}","title":"{{An optimized solution for mobile computing environment}}","year":"{2008}"},{"key":"Huang2007","type":"article","abstract":"{With the rapid proliferation of mobile devices, mobile commerce is widely considered to be a driving force for next-generation e-commerce. Mobile commerce application has attracted the attention of both practitioners and academics. This paper analyzes the diffusion of mobile commerce applications using a new classification scheme that based on the perspective of market. This classification - mobile communication service, mobile information service, mobile transaction service and mobile interaction service, reflects the diffusion of mobile commerce application in the market. It will provide useful insights into the anatomy of mobile commerce application and help us find and design new mobile applications. We also provide some recommendations for future research into mobile commerce applications.}","author":"{Huang, Hao Huang Hao and Liu, Lu Liu Lu and Wang, Jianjun Wang Jianjun}","doi":"{10.1109/ICICIC.2007.265}","isbn":"{0-7695-2882-1}","journal":"{Second International Conference on Innovative Computing, Informatio and Control (ICICIC 2007)}","title":"{{Diffusion of Mobile Commerce Application in the Market}}","year":"{2007}"}]